[
  {
    "number": 1,
    "title": "Holly Jolly Omens",
    "author": "Tori Simpson",
    "synopsis": "Five teenagers in Oakville, Missouri experience unnatural portents during Christmas, 1990.",
    "recap": "December 21, 1990:\nTwas the last day of school before Christmas, and all through North End, a strange magic was stirring, and it was no friend.\n\nDespite the trouble to come, the high school’s pep rally was full of relieved and anticipatory energy–the students were ready for the break from early mornings, loads of homework, and all the other social, academic, and athletic pressures of school. Not to mention the unseasonably warm weather of 60 F and sunny (though that would soon change). But bad things come in threes: 1) Starting with the toppling of the cheerleaders’ pyramid that resulted in injuries and bad blood. 2) Local goth girl, Ash, dreamt of an ominous cavern in a frozen swamp that beckoned a three-antlered deer inside it’s gaping mouth, only for the deer to convulse and bolt away, then die on the swamp’s shores in a decomposed, foamy mess. And 3) The weather on the night of December 21st, 1990, dropped from 60 F to 0 F in a matter of hours. And the city of St. Louis wouldn’t get a reprieve from the snow flurries that followed for some time yet.\n\nDecember 25, 1990:\nIt’s Christmas morning, and we begin with junior and go-getter Michelle, who shields her adorable little bro, Stevie, from their parents’ argument which her dad eventually wins. To the church of dad’s choice (Methodist) they go where Michelle helps out the pastor a little too much and gives a poorly received thirty-one minute sermon. After the service, her bff Sarah tells her it’s okay, but Michelle spends the rest of Christmas with her confidence worse for the wear.\n\nOur next party member, Emerson (also a junior), wakes up that morning and immediately feeds her beloved tarantula before going downstairs to open presents with her enthusiastic parents (though she is primarily a daddy’s girl), and receives a shortwave radio that she is over the moon for. Her brother Dean storms downstairs, in a mood as ever, and finds literal coal at the bottom of his stocking. Em, of course, gives everyone in her family a thoughtful gift and they then go to the Methodist church to sit through the painful sermon from Michelle. But what Em really wants to do is play with her new radio, which she needs to first study up on. The library is closed, and when Em tries to break in, she’s caught by a cop who sends her home. Though she is dejected, her determination remains to get this WWII radio working, and she manages to catch a frequency with voices speaking a language unrecognizable to her, but which her dad claims is Bosk. \n\nCut to a jock with senioritis made infinitely worse by the fact that his girlfriend of seven years broke up with him a couple weeks ago. Nick’s loving mother forces him out of his room that he has camped in for three days and he decides to run it off, and oh, may as well just run by his ex’s place. Shockingly, that backfires when she and her father see him outside their front window as they celebrate the holiday with their family (and hot chocolate burns ensue). Nick and his mom go to the grocery for fish curry ingredients, and he sees a strange shadow-like figure loom behind their car, but no one else sees it. He later turns to his buddies, Dean and Chad, for comfort. Though Dean abandons them for his girlfriend who we will soon meet, Chad and Nick play catch in the snow, which ends very badly as Chad reveals that he is seeing Nick’s ex. In an amazing feat of human strength, Chad proceeds to crush the baseball Nick throws at him in a rage.\n\nBut it’s not all negativity here as we meet our most bubbly party member, Hannah, who painstakingly crafts cards for her teammates injured in the cheerleading tower topple, and ehem, it may have been Hannah’s fault. She gives her overly doting parents their own Christmas cards before they head off to church and witness a family scandal that we’ll get to in a minute. Hannah notices that her bff/Nick’s ex, Jess, is eyeing Chad. The bffs hang out before Hannah delivers the get well cards to two teammates, one of which accepts the mis-rhymed card, and the other who literally shoves Hannah back out her front door. Hannah then eats with Jess’s family before spending the rest of the evening with her boyfriend, and Em’s big bro, Dean.\n\nThe final member of our party really tried to rally herself for Christmas this year, knowing her mom and brother would be insufferably cheerful and her dad indifferent. But those creepy nightmares about the dark cave, the frozen swamp, and the rotting deer have gotten to her, and when her mom gifts her a dress to rival Cinderella’s but worse, pink, Ash decides she can’t play nice like she thought she could. Ash also takes a mysterious gold-wrapped present from under the tree that doesn’t belong to anyone else. She proceeds to make the dress more her style by cutting it, safety pinning it, and covering most of the pink with black sharpie. Her family doesn’t see the redesign until they’re at the Catholic church, and boy does Lisa throw a hissy fit. Ash’s mom then forcefeeds her communion (and ruins her new dress), and Ash is condemned to her room for the rest of Christmas, which she doesn’t mind at all. She opens the golden gift and finds tarot cards inside, they’re heavy and in a language she doesn’t recognize. She pulls a card and feels an immediate sense of dread as she sees pictured on it an individual being tortured by the soldiers surrounding them. \n\nAnd so, Christmas ends with nothing in sight but bad omens, strange happenings, and the promise of raging NYE parties where the high school drama may just reach its height…\n",
    "spotifyId": "6CT7ZQKVafBZjCOCafy5Ad"
  }
]