[
  {
    "number": 1,
    "title": "Holly Jolly Omens",
    "author": "Tori Simpson",
    "synopsis": "Five teenagers in Oakville, Missouri experience unnatural portents during Christmas, 1990.",
    "recap": "December 21, 1990:\nTwas the last day of school before Christmas, and all through North End, a strange magic was stirring, and it was no friend.\n\nDespite the trouble to come, the high school’s pep rally was full of relieved and anticipatory energy–the students were ready for the break from early mornings, loads of homework, and all the other social, academic, and athletic pressures of school. Not to mention the unseasonably warm weather of 60 F and sunny (though that would soon change). But bad things come in threes: 1) Starting with the toppling of the cheerleaders’ pyramid that resulted in injuries and bad blood. 2) Local goth girl, Ash, dreamt of an ominous cavern in a frozen swamp that beckoned a three-antlered deer inside it’s gaping mouth, only for the deer to convulse and bolt away, then die on the swamp’s shores in a decomposed, foamy mess. And 3) The weather on the night of December 21st, 1990, dropped from 60 F to 0 F in a matter of hours. And the city of St. Louis wouldn’t get a reprieve from the snow flurries that followed for some time yet.\n\nDecember 25, 1990:\nIt’s Christmas morning, and we begin with junior and go-getter Michelle, who shields her adorable little bro, Stevie, from their parents’ argument which her dad eventually wins. To the church of dad’s choice (Methodist) they go where Michelle helps out the pastor a little too much and gives a poorly received thirty-one minute sermon. After the service, her bff Sarah tells her it’s okay, but Michelle spends the rest of Christmas with her confidence worse for the wear.\n\nOur next party member, Emerson (also a junior), wakes up that morning and immediately feeds her beloved tarantula before going downstairs to open presents with her enthusiastic parents (though she is primarily a daddy’s girl), and receives a shortwave radio that she is over the moon for. Her brother Dean storms downstairs, in a mood as ever, and finds literal coal at the bottom of his stocking. Em, of course, gives everyone in her family a thoughtful gift and they then go to the Methodist church to sit through the painful sermon from Michelle. But what Em really wants to do is play with her new radio, which she needs to first study up on. The library is closed, and when Em tries to break in, she’s caught by a cop who sends her home. Though she is dejected, her determination remains to get this WWII radio working, and she manages to catch a frequency with voices speaking a language unrecognizable to her, but which her dad claims is Bosk. \n\nCut to a jock with senioritis made infinitely worse by the fact that his girlfriend of seven years broke up with him a couple weeks ago. Nick’s loving mother forces him out of his room that he has camped in for three days and he decides to run it off, and oh, may as well just run by his ex’s place. Shockingly, that backfires when she and her father see him outside their front window as they celebrate the holiday with their family (and hot chocolate burns ensue). Nick and his mom go to the grocery for fish curry ingredients, and he sees a strange shadow-like figure loom behind their car, but no one else sees it. He later turns to his buddies, Dean and Chad, for comfort. Though Dean abandons them for his girlfriend who we will soon meet, Chad and Nick play catch in the snow, which ends very badly as Chad reveals that he is seeing Nick’s ex. In an amazing feat of human strength, Chad proceeds to crush the baseball Nick throws at him in a rage.\n\nBut it’s not all negativity here as we meet our most bubbly party member, Hannah, who painstakingly crafts cards for her teammates injured in the cheerleading tower topple, and ehem, it may have been Hannah’s fault. She gives her overly doting parents their own Christmas cards before they head off to church and witness a family scandal that we’ll get to in a minute. Hannah notices that her bff/Nick’s ex, Jess, is eyeing Chad. The bffs hang out before Hannah delivers the get well cards to two teammates, one of which accepts the mis-rhymed card, and the other who literally shoves Hannah back out her front door. Hannah then eats with Jess’s family before spending the rest of the evening with her boyfriend, and Em’s big bro, Dean.\n\nThe final member of our party really tried to rally herself for Christmas this year, knowing her mom and brother would be insufferably cheerful and her dad indifferent. But those creepy nightmares about the dark cave, the frozen swamp, and the rotting deer have gotten to her, and when her mom gifts her a dress to rival Cinderella’s but worse, pink, Ash decides she can’t play nice like she thought she could. Ash also takes a mysterious gold-wrapped present from under the tree that doesn’t belong to anyone else. She proceeds to make the dress more her style by cutting it, safety pinning it, and covering most of the pink with black sharpie. Her family doesn’t see the redesign until they’re at the Catholic church, and boy does Lisa throw a hissy fit. Ash’s mom then forcefeeds her communion (and ruins her new dress), and Ash is condemned to her room for the rest of Christmas, which she doesn’t mind at all. She opens the golden gift and finds tarot cards inside, they’re heavy and in a language she doesn’t recognize. She pulls a card and feels an immediate sense of dread as she sees pictured on it an individual being tortured by the soldiers surrounding them. \n\nAnd so, Christmas ends with nothing in sight but bad omens, strange happenings, and the promise of raging NYE parties where the high school drama may just reach its height…\n",
    "spotifyId": "6CT7ZQKVafBZjCOCafy5Ad"
  },
  {
    "number": 2,
    "title": "Truth or Dare",
    "author": "Tori Simpson",
    "synopsis": "Nick has a disturbing dream about Chad, while tensions erupt at the weird kids' New Year's Eve party.",
    "recap": "It was a dark and snowy night, with a sky tinged red. Nick wakes in the wood to a vignetted scene and sees a tattered bundle of blankets behind him from which a baby’s wails echo out. He rushes to pick up the baby with dark olive skin and pointed ears. Despite the peaceful snowfall, the baby’s mouth, eyes, and other orifices start foaming reddish crusty liquid that startles Nick into dropping the baby. He runs away and reaches a pond that reflects back at him the blackened, armored figure that he glimpsed behind his car, and it too begins to foam red before removing its helmet to reveal Chad’s face beneath. Nick awakens for real this time to see deep snow and kids playing outside through his bedroom window. When his mom checks on him, all he can say is “Creepy baby!” Nick recovers fairly quickly and calls up the team and adjacent friends for a NYE pregame where the dresscode is black tie hopeful but varsity jacket reality. Drama ensues behind whispers and pointed looks as the cool kids begin their celebrations.\n\nSpeaking of cool kids, Hannah is feeling slightly uncool, possibly for the first time ever. Her teammates are unhappy with the pyramid fiasco, which drives Hannah to dedicate herself to the delicate craft of cheerleading harder than ever. Dean doesn’t quite answer correctly when Hannah asks him if he’d still love her if she was a worm, but at least he still would if she wasn’t a cheerleader–or would he? After an awkward dinner with Hannah, her parents, and Dean, the latter wins back some points after police captain dad sees the pristine condition of his red 1988 Chevy Camaro… eye roll. All at the dinner party are relieved when it’s time for Hannah and Dean to go to the NYE pregame.\n\nMeanwhile, Ash spends the several days between Christmas and New Years walking the cemetery, reading tarot cards, and watching bad movies with her dad. April and Roberta, juniors who adore Ash, invite her to a different NYE party at a kid named Carlos’ place, which she gladly sneaks out to attend. Before she leaves for the party, she tries out her mystery tarot cards once more and feels a chill to her bones that has nothing to do with the cold weather when she once more pulls the same card displaying an individual being tortured by the soldiers surrounding them. She shakes off the ever present feeling of dread and tucks the cards away before the party–she’ll take her safer deck this time. While sneaking out, she also catches her brother, Chad, doing the same, and they share a rare heart to heart that sparks some affection in Ash–though she still loves to hate him, the love is beginning to win out against the teenage contrariness.\n\nIn the time in between, Em has been absorbed in her new radio, and frequents the town’s libraries to try and figure out the strange language emanating from its waves. That and, naturally, taking attentive care of her beloved insects and arachnids. Em drives Pat (who is feeling rather left out for not getting a bespoke mixtape from Em like Anna does, especially since he carved a knife for Em as her holiday gift) and Anna to the nerd and theater kid party, also securing a safe space at Carlos’ for the beloved comfort tarantula, Agent Orange. \n\nAt Carlos’ the classic game of Truth or Dare commences, revealing a little too much of people, and though the night successfully unites two of our party members as newfound friends, Em and Ash, other relationships crumble as insults about class and sexuality are aired. Agent Orange definitely came out as the winner of the popular vote at the un-popular party. \n\nThings at Carlos’ party could have been better, but they also could have been worse. That’s more than can be said for what’s sure to be an even more drama-filled party of the high school’s top dogs. \n",
    "spotifyId": "5ghIJDpPoe3CfHMGu71E6T"
  },
  {
    "number": 3,
    "title": "Bad Vibrations",
    "author": "Tori Simpson",
    "synopsis": "The teens uncover definitive evidence of the occult through radio transmissions and an ominous standoff.",
    "recap": "December 27, 1990:\n\nThere is no greater act of friendship than bringing gallons of oatmeal through the cold and snow to your best friend who is living in a house plagued by chicken pox. Sarah is a real one, and Michelle is ever grateful for her trusty VP. Though Michelle spends the wayward days between Christmas and New Years stuck at home with her itchy little brother, she’s rewarded by going to the cool kid’s NYE party with Michelle to start getting her name out there among the movers and shakers of suburban St. Louis. \n\nDecember 31, 1990:\n\nDean drives Hannah and Jess (in style and already high) to Jess’ house to prepare for the big bash. More and more of the high school’s elite pour through the doors of the McMansion, but the party doesn’t really start until 10pm when the football team shows up fashionably late Entourage-style, organized by our adventurer Nick who gives a rallying speech worthy of the battlefield (and this may just be one). As the partygoers start stretching their social muscles, some more effectively than others, Hannah comes across two enemies–one, a be-braced girl with an atrocious perm, the other, her teammate whose arm she accidentally broke during the pyramid tumble. To take the edge off, Dean, Ben, Hannah, and Nick take a tab of acid–and Dean takes three. \n\nMore cold shoulders and giddy embraces ensue during the party’s kick-off, while Sarah and Michelle stand alone in a secluded corner cooking up a plan on how to work the crowd, that is, until StuCo Prez and Bball Captain Christopher Yoon exchanges blows in the form of cutting words with a more than prepared Michelle. Move aside, Chris, Michelle has a 10 step plan to become the POTUS, and it starts tonight. And her first opportunity to win over some new constituents comes in the form of beer pong.\n\nAt the encouragement of dear Sarah, Michelle plays some beer pong for the first time in her life and does win over the hearts of Hannah, Nick, and an increasingly tripping Dean. But though beer pong scores many points for “guardian angel” Michelle, Nick and Hannah play pong well, but not so much their social cards, and high school reporter Kenny Quick lives up to his name and captures all the drama. Not the least of which being that Jess has not heard from her newish boyfriend Chad for days and is very upset and confused, but Hannah remains steadfast in her support and encouragement. Though she does accidentally start a rumor that Jess is pregnant when Nick starts talking about a creepy baby, which Kenny picks up on. Nick is beginning to spiral, so sober “guardian angel” Michelle decides to drive Sarah, Nick, Hannah, and Dean home in the bone-chilling cold.\n\nAfter the witching hour has passed, drama of a different, darker kind stretches its limbs at the nerd party. Ash does tarot on as many of her peers as possible (luckily there is no shortage of people who want their fate read), keeping a close eye out for BLANK, but it never shows its dread-inducing face. Me, meanwhile, is quite tipsy, and as she sways to the rock music, she can’t help but spill to her friends about the radio with the strange language riding its waves. In an adventurous spirit, they decide to go back to Em’s and give it a listen, and Em brings her newfound friend, Ash, along. Ash drives them as the least drunk person there, and then the four friends gather in Em’s room. Pat and Anna have a knack for languages, and when an announcer starts speaking, they confirm that the language is Arabic and all wonder how this radio is picking up a signal across the world. Em turns to another channel and static crackles, punctuated by the raspy, hushed voice of what seems to be an old man frantically repeating the words “amal rotha”. The voice breaks as it increases in volume and desperation, and suddenly, it cuts off, leaving behind only the haunting sound of static. The teens look at each other in fear and unsettlement as the static persists. Pat, the most visibly shaken, confirms that that was not Arabic, and it was unlike anything he’s ever heard. Ash, too, is disturbed, knowing instinctively that this is the language on her mystery tarot card deck—but she tries to keep her cool even as she calmly insists to an intrigued and notably less bothered Em that she needs to go home immediately to consult her cards.  Em writes her number on Ash’s arm insisting that she call tomorrow, and has her cool dad drive Ash home. When Ash arrives home undetected she is unable to sleep and eventually works up the courage to draw from the deck, coming up with that same omen again and again. The dread causes her to dry heave and she takes a shower to wash off the feeling—spoiler alert, it doesn’t work. She’s lying restless in bed when the phone rings, and thinking it’s a sign, Ash picks it up to hear a voice she didn’t expect, Jess. Jess asks where Chad is, to which Ash sassily answers that she thought he’d be with her. He is not, and when Ash checks his room and finds it empty, she can’t help but think this is all connected. Well, she’s not wrong…\n\nAs Michelle drives everyone home, a darkness darker than the night stands starkly against the snowy road. She calls her friends’ attention to it, and Nick tries to gulp back his fear as he realizes that it’s the armored figure from his nightmares, asleep and now waking. Michelle taps the brakes (ever practical and in control), but Nick decides to get out of the car with his steel bat, challenging who only he thinks is Chad, to which everyone screams at him to get back in because this is a bad idea. He shockingly doesn’t, and when the car slips it bumps into Nick and pushes him into the shadowy entity, it grabs his shoulders, and says “tabaxi”. Nick stares up, horrified, but it simply dissipates into gray dust blown away by the winter wind. The teens are in terror, and they pull Nick back in and quickly drive to Dean’s house and hole up in the basement together, too scared to separate after some good ol’ trauma bonding. Nick notices a stain of red foam-ish substance on his shirt, and knows this isn’t over. \n\nJanuary 1, 1991:\n\nAsh’s nightmare isn’t over either, for she’s woken from a fitful sleep by a pounding on her door. Her mother bursts in, saying Chad is missing, and for once biting back sarcastic comebacks, a deathly worried Ash scrambles out of bed to find out what happened to her brother.\n",
    "spotifyId": "46MX86XQqYCZRvwPpeq4Gi"
  },
  {
    "number": 4,
    "title": "Where's Chad?",
    "author": "Tori Simpson",
    "synopsis": "The new year dawns, revealing that a popular football player has gone missing.",
    "recap": "January 1, 1991:\nTwo may be a coincidence, but three is a pattern, and now our third party member is plagued by a foreboding nightmare. Green, frozen darkness. Limbs flailing and grabbing at her. Hannah is shoved through the iced over surface by gnarly hands beneath her and emerges atop a frozen lake; on the horizon is a red-tinged sky. Ring a bell?\n\nThe usually cheerful cheerleader wakes in Dean’s basement among the others, sobbing, and rushes to the bathroom. Chaos and confusion ensue in the basement as Nick, Dean, and Michelle also get up (Nick not having slept at all) and start questioning whether LSD is contagious. Who knows? None of them do. They decide they need to find Chad and head upstairs to a full kitchen. Em, Pat, and Anna are with the parents in the kitchen, and while the cool kids hide the full truth from Em, they tell her that they’re going to help look for Chad and Em says they should bring in Ash. \n\nAsh knows her parents are overbearing and often overreact, but she has an awful feeling that Chad is really in trouble this time, even though he hasn’t technically been gone that long. They tell her to stay in the house while they go out to look for their golden child, but she calls Em to pick her up so they can do some sleuthing of their own. Em and Ash head the designated meetup place, Jess’s, while the others go pick up the cars they left around town. They stop by the spot where they saw the dark knight, but besides some red droplets in the snow there is no evidence. Hannah picks up some of the red foamy substance in her jacket just in case. While the jocks and presidential hopefuls are doing that, Em and Ash decide to ask Jess themselves, against their better judgment. Unsurprisingly, Ash and Jess do not get along and no progress is made. Hannah does damage control when the other teens arrive and stays with Jess through her very difficult time.\n\nAsh and Em wait dejected in the car and Ash has Em pull from the mystery tarot deck; Em pulls blank cards over and over, and Ash pulls a cherub with olive skin and wings flying with red sky behind it and it has a red fingerprint. Ash has no clue what this means and the blanks are a strange occurrence, but she knows something important or impossible has happened. Dean, Nick, and Michelle still don’t admit the full story to Ash and Em, but they do make a concerted effort to spread out and look for Chad. During the search, the kids finally connect that a few of them have been having similar dreams with different bad omens, and are now all on the same page.\n\nJanuary 2-last day of winter break 1991:\n\nSadly, enough time passes that the police do have to get involved, and each of the kids get questioned to no avail. Ash arrived home to a hysterically distraught mother who puts her on couch-arrest for the remainder of break for sneaking out when her brother is missing (Lisa reported Ash missing as well, prematurely). We finally meet coach, who takes this stuff seriously and even goes so far as to offer his players (teenagers, might I add) guns in case they need to protect themselves. His beloved German Shepherd, Nancy, also joins in the hunt, but Chad’s trail has run cold. Em gives each of them walkie talkies to stay in touch throughout the rest of winter break. Em gathers books on many topics from tarot cards to ancient languages to semiotic. She delivers some of the books to home-bound Ash and to Nick, who also becomes obsessed with his dream and the dread that has become nearly and increasingly unbearable.\n\nAs the new semester approaches, each adventurer does their own part to either continue to search for Chad or investigate the strange occurrences that have been happening. Ash willingly goes to church for the first time after pulling a tarot card with a priest on it, but finds nothing at the Catholic church. Michelle’s family have gotten into the mega-church broadcast and the congregation prays for Chad on live TV, and her little brother tells her about a new friend in a giant rat that crawled in through his bedroom window, but she brushes it off as his active imagination (though, you can never be too careful these days). The night before school starts, Nick’s anxiety has reached a breaking point. His mom knocks on his door to check on him and leaves him to get some sleep. Then, another knock sounds on his door–before he can answer, it slowly creaks open and metal steps reverberate on the floor. The dark knight stands before him, and Nick is quaking in the corner of his room holding his trusty baseball bat. Nick asks what the armored figure did to Chad, and it answers that it didn’t do anything to the demon. It then removes its helmet to reveal a face with dark green skin, pointy ears, and tusks on either side of its mouth to tell Nick that if he doesn’t want to end up like the demon he needs to come with. Nick simply asks, “Go where?” \n\nAnd then there were two missing teenage boys in smalltown Oakville…\n",
    "spotifyId": "44pN9jfSqY3d3lrKuv3QeN"
  },
  {
    "number": 5,
    "title": "Teacher's Pet",
    "author": "Tori Simpson",
    "synopsis": "After a second football player disappears, an English teacher's odd behavior piques the gang's interest.",
    "recap": "First Day of Spring Semester: January 7, 1991:\n\nIf three is a pattern, four is a damning certainty. In dreams, Em stargazes under a purple sky and sees a mountain range in the distance. As she walks towards it, pebbles shift behind her to reveal a sinister canine-like creature that attacks her with teeth and claw. More join the bloodthirsty frenzy and Em is being torn apart until a giant mechanical arachnid sprays the beasts with a blue glue-like substance that scares them off. The gargantuan spider covers Em with its webbing that heals her wounds, and she feels a sense of comfort before she wakes and immediately jots down her nightmare. Despite being very thrown by the vivid experience, Em heads to her first day of the spring semester, shaken but prepared as ever when she checks in with the rest of our party using her trusty radio. Well, the rest of the party except for Nick…\n\nEm begins her day at school in the activities office, where she aids Mr. Smith in prepping the morning announcements while Michelle delivers them to the school with Sarah’s help. Among other things, the student body is told to keep the missing Chad Higdon in their prayers. Ash prepared for the attention to be more on her than usual, and does her utmost to look unapproachable and standoffish, which she’s already pretty good at. Hannah uses another tactic to prepare for what’s bound to be a crazy semester by doing jazzercise videos before school to drown out the fear. The rest of the school, though not having been privy to the events of the holiday break, also feels tense and on edge with Chad’s disappearance. Ash largely makes it through her classes without anything unusual happening, that is, until she gets an undeniable sense of familiarity between her mysterious tarot deck and Ms. Poe’s Hawaiian-shirted chinchilla, Applebee. More on that later. \n\nThroughout the day, Chad’s absence is very noted, though our adventurers try to remain calm. Luckily, there is a StuCo meeting after school that provides a welcome distraction for Michelle and Hannah. After much debate, the important decision of where prom will be held is made: the botanical garden (on 4/20, much to Dean’s chagrin). Em and Ash have their own after-school endeavors as well; Em, to study the red foamy substance left behind by the dark night using the school’s chemistry equipment, and Ash, to get a better read on Ms. Poe and her class pet in relation to the tarot cards. Em doesn’t make much leeway, though Ms. Jones’ interest is certainly piqued. Ash confirms that Ms. Poe definitely knows more than she’s letting on about this supernatural conundrum, especially with how interested she is in the tarot cards that she claims to know nothing about, but Ash can come to no definitive conclusion about the beloved literature teacher. Em and Ash then hang out at Em’s place and go over the dubious Ms. Poe, and Em excitedly tells Ash about her visceral nightmare. They test the radio, but there is nothing new to be heard there, and when Ash decides to head home, Dean is arriving. He pulls his sister aside to let her know that Nick is missing too, now. Word spreads fast, and the ever polite Hannah goes to check on Nick’s parents and check out his room. She finds nothing helpful save the radio given to him by Em and pockets it. \n\nThe kids are more confused than ever as they try to put together clues from tarot cards, strange dreams, radio signals, foreign substances, and a cute chinchilla, not to mention two missing teenage boys. After day one, they all know that it’s going to be a long semester.\n",
    "spotifyId": "3nvuPQTw2zuFAVuLsC9IYQ"
  },
  {
    "number": 6,
    "title": "Whispers",
    "author": "Tori Simpson",
    "synopsis": "The gang continues collecting and interpreting clues related to Nick and Chad's disappearance.",
    "recap": "January 7, 1991:\n\nAfter a long first day back at school, Hannah gets home in much lower spirits than she’s used to. It’s dark and cold outside, and her phone rings. She answers it to hear heavy breathing… but it’s just Dean freaking out that two of his close friends and teammates are now missing, and he thinks he’s next. Hannah rushes over to Dean’s to comfort him, and does, but she also runs across Em and trades some information, books, and keeps Nick’s walkie talkie so she can stay in touch with the rest of the party (her code name is Glitter). Hannah tells Em to take care of her distraught older brother, which Em takes too much to heart and ends up triggering the trap she set up to protect Dean. The cops, including Hannah’s dad, come to question Dean before school the next morning, but find he doesn’t know anything (or anything that they’d believe, at least). The police question the rest of the baseball and football players as well as the coach who has started a manhunt of his own to look for Chad and Nick.\n\nUnsurprisingly, the energy at school is still bad, and Ash wonders how she’s going to make it through another day of stares and whispers. One person who’s not bothering to whisper is Kenny Quick, who asks Ash if she thinks Nick killed Chad and dipped. Luckily, Jason and Ms. Poe come to her aid, not that she needed it, and Ash is relieved that Ms. Poe doesn’t seem to have changed in reaction to the tarot card incident from the previous day, yet…\n\nCut to one of the worst places on Earth, the high school cafeteria. The nerds are still divided after the NYE drama where blows in the form of cutting words were exchanged, so Em and Ash sit by themselves–they have enough drama to deal with. And an epic showdown between Michelle and Chris ensues when the future POTUS disproves Nigel’s claims that Chris did all the planning for prom. \n\nThe next step in the plan comes in the form of Em startling Ms. Po before class by shouting “amal rotha” at her. She is visibly shaken, and keeps glancing sharply at Applebee, especially when Em asks whether there are tabaxis in the story of Beowulf. Po clearly knows something about the tarot cards which she is not disclosing, and when Em shows her the red foam she looks very scared. She says she is frightened and sad for the missing students, and Em makes a mental note to follow up on this tomorrow at Animal Club.\n\nAfter another fraught day, the kids decide to meet at Hannah’s after school to discuss further. They focus heavily on the tarot cards, and along with finding out the Ms. Po has pointed ears, some of the characters on the cards look like her. Ash also pulls past, present, and future readings for each of the party members, Nick, Chad, Ms. Po, and Dean. Please consult the notes I sent in the Discord for more details. Hannah’s mom interrupts the witchy meeting to call for dinner, and Em and Ash leave. Michelle stays over, though, as she and Hannah have become surprisingly close of late. But Michelle is not the most out of place thing at dinner that night–Hannah finds herself repulsed by the cod which is usually a favorite of hers.\n\nEm and Ash go to their own homes and do their normal routine of checking the radio and the cards respectively, and Michelle goes home as well to finish her homework. Michelle prefers a solid night’s sleep each school night, but she is awoken much earlier than usual the next morning when piercing screams resound from Stevie’s room. Michelle rushes to her little brother, as do their parents. He had a nightmare about his grandfather dying as he laid prone with red stuff seeping from his mouth, and apparently Michelle was in the dream too and didn’t do anything about it. She’s worried for her brother, but eventually chalks it up to possible carbon monoxide poisoning. For some people, not even seeing is believing…\n",
    "spotifyId": "4CoSCPlKNrWli7E5kFtbcl"
  },
  {
    "number": 7,
    "title": "Uncaged",
    "author": "Tori Simpson",
    "synopsis": "After fending off an alien creature, a class pet pulls back the curtain on the strange happenings.",
    "recap": "Wednesday, January 9, 1991:\n\nPerhaps more frightening than her recent nightmares is the fact that Ash’s mom has been burning breakfast on the regular since Chad’s disappearance. Never in her life has Ash witnessed her mother perform her housewifely duties so, well, imperfectly. And when Ash’s dad goes for a bowl of cereal instead, Lisa gets furious and insists that they save it for Chad’s return. This disturbs Ash more than anything, and she heads to school deeply sad.\n\nOakville High is still, unsurprisingly, off, but some things never change. The cogs of the teenage social structure machine are ever turning, and Michelle sees it as a major win when Chris asks for her help in asking Eliza to the winter formal. LANG / MADDOX 2020. Despite the overhanging unease, the school day passes without any hitches, and even the suspect Ms. Po, though more reticent than before the confrontations with her students, is as magnanimous and kind as ever.\n\nHannah hatches up a plan to try to break through Po’s adamance seeing as Hannah never has and never will have Ms. Po as a teacher. Pretending to write an expose on Oakville teachers, the cheerleader turned investigative reporter interrogates the beloved teacher but doesn’t learn much (though Hannah does win brownie points with Ash for cleverness). Ash then takes a more direct approach and demands Ms. Po tells them what she’s hiding, which she resolutely refuses in the name of the party’s own protection, begging them to stop their quest. Ash says they, and she, won’t stop, obviously.\n\nMeanwhile, at Animal Club, Em spills some deets to Pat, claiming Ms. Po is an alien with pointy ears, and if Pat wants to prove his loyalty to Em, he’ll come with her to check on Applebee and once again confront Ms. Po (poor woman, but she is their only lead). A confused Pat follows Em to Ms. Po’s class, and Po is as staunch as ever, but Em notices very strange and human-like behavior from the be-shirted chinchilla when she holds the red foam up to it. \n\nThat insidious substance makes a surprise appearance at Yearbook Club, when after a battle of the brains, or rather, popularity, a pissed off CJ begins to kick Hannah out of the club when she abruptly falls to the ground and a greenish, worm-like creature with three concentric circles of teeth slithers out of her sleeve as she lays prone, then proceeds to attack Hannah. Hannah gets bitten twice by the monster that has the ability to, yes, fly, and runs out of the art classroom and down the hallway screaming. Po, Applebee, Em, and Pat hear the scream and Applebee seems to elongate in shape as it attacks the thing and kills it viciously. Ash arrives late to the game and catches only the aftermath of the bloody remnants of God knows what with Po and Applebee posted up in a disconcertingly anthropomorphic stance over its remains.\n\nAsh and Em go to check on Hannah who has collapsed against the lockers, and then they go to the art room to check on an unconscious CJ and call an ambulance. Ms. Po is still not forthcoming despite true and immediate danger having presented itself, and Hannah and CJ are taken to the hospital on stretchers. CJ will *likely live, and Hannah is discharged after a couple hours, and she and Ash go to the library to check out The Green Knight and a yellow pages to find out more about Po while Em gears up for some light espionage and shenanigans at home. The three then also loop in an unbelieving Michelle to snoop around Po’s classroom after hours, and when that yields no results (though there is a distinct lack of personal pictures), they decide to check out where she lives, much to Michelle’s disapproval. \n\nThe four adventurers arrive at Po’s apartment complex and see that all is dark inside, so they go around back and peer through the window and see a normal apartment and Applebee’s cage. The uncanny animal turns to look at them, and they all duck under the windowsill but it’s opened from within by none other than the class pet himself. Applebee is once again posted up on the window ledge, and demands of the four “Why’d ye do that?” when Michelle tries to close the window on him. This, of course, is the last thing each of them expected to happen, and the four students back up on the porch in shock and disbelief as they together experience their first talking animal. After much gaping and stuttering, Em drives the five of them, including good ol’ AB, to Sylvan Springs, a park which will offer them cover in case of prying eyes and ears (because most people in small town Missouri are on the lookout for teenagers and their talking chinchillas). AB explains to the party that he is a Myrehair, and he and Ms. Po (a wood elf) are from the Myre in the magical realm, and that they came here via a portal that Ms. Po’s brother, Savano, made twenty years ago to save them from their doomed realm (the details of how that all came to pass AB decides to save for another day). After learning that “Amal Rotha” means “Praise Rotha” (again, AB spares the party the scary details of who Rotha is for now), a Tabaxi is like a cat person, and he left the cards for Ash to find, the kids are overloaded with magical information yet still brimming with questions. Applebee tells them that all will be answered in due time, and that each of them have untapped magical potential that he would like to coax out and hone for them to use in this fight against evil which Ms. Po was trying to protect them from. Cut to hero training montage in the likes of Mulan and Hercules (AB is both Mushu and Chiron). They then all go home to sleep before school the next day, or not, after their understanding of reality was flipped upside down. Needless to say, Ash is beyond thrilled and has the best night of sleep since before the dreams started.\n\nUnderstandably, a lot of emotions are running through the mind of each party member as they prepare for school the next day, and Hannah days to play hooky and take a day to absorb the events of the prior night (while continuing her research of the wordy Green Knight). Skipping school was either a really smart or really dumb decision, as we’ve yet to find out what happens after none other than missing boy #1 walks up the hill towards the school, across the football field, and down the main hallway as the sea of teenage bodies splits before him and Jessica cries out, “Chad?!”\n",
    "spotifyId": "1z3ugFmUKoCzGsI6jdY4Ci"
  },
  {
    "number": 8,
    "title": "The Return",
    "author": "Tori Simpson",
    "synopsis": "Chad mysteriously reappears in the halls of Oakville High, raising more questions than answers.",
    "recap": "Thursday, January 10, 1999:\nDear God, please stop giving my friends nightmares. I feel like you could have at least prevented this one, because it takes place in a church. Michelle’s extended family is gathered near the pulpit dressed in black, surrounding an open casket holding her grandfather. When Michelle steps forward, her grandpa sits up and smiles at her, red foam oozing from his orifices. The rest of the family save Stevie are also bubbling over with red foam, and Stevie once again accuses Michelle of not saving their grandfather. Michelle wakes to Stevie screaming and finds out they had the same dream. How are you going to deny the supernatural now, Michelle?! Amen.\n\nMeanwhile at school, Pat is mad at Em for leaving him retching after the flying wyrm of the evening before, and at Spanish Club after school Em explains a bit more about the strangeness of late, but it honestly leaves Pat more confused than ever. April and Roberta, ever in character, invite Ash to a seance which she’s unsure whether she will attend (there’s a lot going down, and shit’s about to get even crazier). Em’s friend Anna runs up to Ash at her locker and pulls her into a crowd of students, and to Ash’s utter disbelief and tentative relief, she finds her brother sitting on the hallway floor flanked by Jessica and Dean. She immediately rushes to him and gives him a very uncharacteristic hug, and though he returns it forcefully, there is still something off about him (covered in bruises and oddly bloated). An ambulance takes him to the hospital, and Ash’s parents pick her up to bring her there to meet him. Needless to say, Oakville High is absolutely buzzing.\n\nWord of Chad’s return is rapidly spreading; Dean calls Hannah who is playing hooky to let her know, and Michelle writes a note to the party members that they need to update AB. At the hospital, the Higdon family finds out that Chad only remembers being in the wilderness near the Meramec River, and when Ms. Po offers him cookies he doesn’t eat them, despite being supposedly starving for weeks. \n\nAfter a long day at school, Michelle goes to visit her grandpa in light of her recent nightmare. He lives far out in the country, and despite her mention of the red foam, he seems to be doing just fine and has no reaction to the odd occurrences. When she gets home, her parents are yet again watching the megachurch broadcast, and the pastor claiming that their prayers returned Chad to his family and home–thanks so much, God. Her parents comment on Chad, and when Michelle presses they say some weird things happened in the 70s, but give no more context.\n\nAsh and her parents bring Chad to their home surrounded by news vans and crews, and they fuss over him but sensing his shellshocked state, decide to leave the heavy questions for another day. He eats during dinner, but he seems very out of it, and later that night Ash catches him reciting a prayer before bed, which he has never done before. Ash consults her tarot cards about Chad and pulls the one depicting the priest.\n\nEm is at home after a blissfully uneventful Spanish club working on spider prosthetics and homework, and notices Hannah on the news driving by the Higdon’s house as Chad returns home. Despite skipping school, Hannah had an eventful day off; she visited the library and found out about some mysterious sinkholes from the 70s when AB and Po came over from their realm, and she met with Jessica who insisted upon skipping school again the next day to go shopping, but skirted other questions from Hannah. Oh and by the way, Jessica is so over Chad now, he’s kinda gross. \n\nAt the end of the day, Em radios our adventurers, and they all trade updates. Dreams, red foam, found brothers, and a talking chinchilla make for a very eventful week, but it’s not over yet.\n\nFriday, January 11, 1991:\nChad is still slow but chipper the next morning, and he eats the soggy cereal his mom saved for him. Ash drives him to school, but when she mentions that Nick is missing, he is so distressed that they decide to return him home for the day. \n\nMichelle checks on Stevie who is shaken but sadly getting used to the nightmares. Em decides to bring her old military radio to school to show AB later, and Hannah radios the team to let them know that her marks are strangely gone, but she is still skipping school and will see us for the magical training montage at midnight. \n\nAsh heads back to school, and along with Em and Michelle, finds a note in her locker from AB clarifying their meeting place tonight: under the bleachers at midnight. They decide to meet 30 minutes early to check out the sinkholes. \n\nCut to Hannah and Jessica at the mall shopping away, when suddenly Jessica insists they have to head to the parking lot. Hannah is wary after everything that’s been happening lately, but her worries vanish as she walks out to see Dean holding a dozen roses while his Camaro blasts Baby, I Love Your Way. He gallantly asks her to the winter formal, and she squeals an enthusiastic yes. And thus ended the session on a positive note that for the first time didn’t give me actual nightmares. \n",
    "spotifyId": "1ksayCHVLH4eKFm43GFokU"
  },
  {
    "number": 9,
    "title": "Know Thy Enemy",
    "author": "Tori Simpson",
    "synopsis": "After a seance in Jefferson Barracks Cemetery, the gang is trained in combat and magic by Applebee the Myrehare.",
    "recap": "January 11, 1991:\n\nBe there or be square; there is a seance in the graveyard after school today. Ash and Em go, but shut things down quickly when they see a small creature through the mist that seems to be stalking them and feel that it’s definitely something supernatural. \n\nFrom one supernatural thing to the next, it’s time to train. Bleachers behind the school at 11:30pm. The party takes a look at the remnants of the sinkholes that opened when Po and AB first came through the portal from the Myre twenty years ago, and then the real fun begins. AB is a ruthless but encouraging teacher, and after some rapid fire questions from the adventurers regarding the Myre, we begin to work and defense and attack. By the end of the magical training montage, AB declares it’s time to find a portal…\n",
    "spotifyId": "4N0TP4Rmj6QQezWV88ARNJ"
  },
  {
    "number": 10,
    "title": "No Quarter",
    "author": " - ",
    "synopsis": "A mysterious figure once thought to be a foe provides Nick with answers and a new purpose.",
    "recap": "Summary under construction.",
    "spotifyId": "0GRBFjza23Im7Xb16c9AaK"
  },
  {
    "number": 11,
    "title": "The Boys are Back",
    "author": "Tori Simpson",
    "synopsis": "After being rescued by Nick and Kha'Ragul, Ms. Po inadvertently reveals the portal's location to the gang.",
    "recap": "January 12, 1991 @ about 1am:\n\nThe first thing you do when a talking chinchilla tells you it’s time to find a portal is break into your high school to find some maps—I love writing a sentence that I think no one has ever written before. Anyway, to the Meramec River the party goes.\n\nAlso along the banks of the Meramec River is newly war-hardened Nick, who has been missing from Oakville for some time. And he has a friend with him; Keragool, a tall, green, tusked knight who has clearly been leading Nick on some fantasy adventure which has yet to be revealed. A rustle in the trees outside their campground reveals another surprise appearance, a ski-masked figure who we quickly learn is Ms. Po, come to save Nick from who she thinks is his captor. Nick goes with Ms. Po with plans to reunite with KG later, but before they make it back to her car they spot two knights in golden armor with red underneath their helmets. The knights spot the duo after a bad stealth roll, and Po shoots arrows at them and tells Nick to run while she distracts them. Nick gets away, but being the gallant jock he is, meets up with KG and they go back to rescue his rescuer. \n\nMeanwhile, the kids in magical training camp go to another part of the river to look around. Thankfully, as they are grossly underprepared, they are far from the golden knights and find nothing of significance. Ash pulls a tarot card to try to get a sense of the scene, which shows a blue figure standing on a beach with a droplet of water in their hand looking out towards a large body of water under a cloudy sky. AB says the figure is a sea elf which are extinct, but no other conclusions are reached. The team decides to meet at a more northwestern spot of the river at 3pm, as it is already encroaching on that hour in the AM.\n\nNick and KG come upon the golden knights’ encampment, and spy from among the trees. There are two giant Roman Imperial-esque tents, and Po is tied up in one of them, surrounded by three golden knights and a golden-robed figure. Nick and KG decide on a distraction tactic, and after setting fire to trees doesn’t work (Smokey Bear would highly disapprove) they set fire to the tent. They end up freeing Po but are pursued as they run away—and after a series of too-close calls in which Nick realizes just how powerful these knights are (spoiler alert: they are extremely deadly)—Nick, Po, and KG all escape. Nick and Po have a heart to heart before Po takes him home, and upon arriving home Nick decides to sleep it off and give his parents a happy surprise in the morning.\n\nIn the 12 hours between river treks, Ash checks on her brother who is about to go tux shopping with their parents (Ash gives a resolute no when asked to join). Em works on her attunements by surrounding herself with insects and heavy metal music in her room, and also goes to the camping store for some adventuring supplies. Michelle is well-rested and ready to channel Lady Justice. And Hannah has some confusing moments with Dean as she is hiding a very big supernatural secret from him, but she also collects supplies from her Dad’s toolbox and such in their unfinished basement and puts them in her own bedazzled bag.\n\nNick’s parents are, needless to say, shellshocked and immensely relieved to see him the next morning, and they share a heartfelt moment before Nick asks them if they know what a Tabaxi is, much to their confusion. Word spreads of his return, and the party all eventually find each other among the chaos and more hugs and tears of relief ensue. The intrepid heroes decide to meet in Michelle’s basement to talk further, and when Michelle goes to retrieve AB with a promposal poster, Po is on to them so fast. But, luckily or unluckily depending on who you ask, Po inadvertently points them to exactly where the portal is. \n\nAt Michelle’s we learn that Nick was in the Myre with Kha’Ragul training to be a Devoured Knight, which is a resistance group that works against the Telurian Kingdom (shoutout to the golden knights, and to Ash’s newly demonized brother Chad). AB and Nick and KG believe that Po is the one the knights are after, and it’s called into question whether she should just go with them to protect this world from the Telurian invaders. Having had enough magical tea spilled for the day, the team decides to meet later to decide what to do next, and to have a rendezvous with the evermore mysterious Ms. Po…\n",
    "spotifyId": "44aTAUBF0g6sMkMNE8I5kd"
  },
  {
    "number": 12,
    "title": "Into the Myre",
    "author": "Tori Simpson",
    "synopsis": "With Applebee by their side, the teens enter the portal and into the magic realm, encountering grave danger within.",
    "recap": "January 12, 1991:\n\nFinally, the moment we’ve all been waiting for: all of us together doing cool magic shit. Well, everyone except one. While AB dictates spells in Po’s swiped spellbook for the party to put in their arsenal, Ash must access her magic in a slightly more convoluted way… communing with a demon. Her mother would hate nothing more…\n\nOnce asleep thanks to Benadryl and general exhaustion (hey, being a magical teenager is like really hard), Ash finds herself in a familiar nightmare, and embraces it by following the three-antlered deer into the gaping cavemouth. She follows the deer downward surrounded by walls made of tree roots and time loses meaning (think Alice down the rabbit hole here). She arrives in a large cavern with a small waterfall trickling into a basin at one end, which the deer drinks from. Ash cups her hands to partake as well, but the liquid burns her hands and a dark purple substance pools into the basin from her hands. Ash shouts and closes her eyes from the pain, and is suddenly enveloped in an eternal darkness of deep purple and stars, floating in nothingness save for a shiny surface below which rises up to meet her rapidly as she fruitlessly tries to flail away. She wakes suddenly just as the unknown is about to reach her and finds herself on the couch, hearing the excited shouts of her friends practicing magic in the backyard.\n\nMeanwhile, the party gleefully discovers that Nick’s magical axe can be easily wielded by any scrawny teenager out there, and lightning, healing, and inspiration spells ensue with great enthusiasm. When Ash joins them to describe what happened they decide their next stop is a long rest and to meet at Nick’s at midnight to plan further action items with Nick’s new half orc buddy, KG. \n\nThey rendezvous at Nick’s and drive towards the Meramec river–on the way they notice Chad’s alleged hideout from when he was missing, as well as a brand new megachurch on the river’s edge (I wish there was a way to get them to pay more attention to this clearly important plot element without metagaming). \n\nUpon arriving at KG’s camp, we learn that he is part of the order of the Devoured Knights which strives to resist the Telurian army. Nick communicates with KG using a translation ring with the phrase “When your throat runs dry return to the river” engraved upon it. Each of the party introduces themselves to KG, and KG has heard of Po and her brother Sylvano as true rebels who caused a lot of trouble, which is certainly why the Telurian army is now on Earth, specifically smalltown Missouri. After that somewhat awkward moment, they decide to go through the portal to scope out the actual Myre. \n\nAfter a trek through the dark forest the party comes across a door of crackling blue light which reflects its surroundings like a mirror, surrounded by a floating flow of rocks and sticks. It’s 1:30am, and Michelle sets a timer for 4 hours since time works differently in the Myre. AB goes first, with eagerness but also trepidation to return to his homeworld, followed by an ever chipper Hannah, and then the rest. It’s dark and lightly snowing in the Myre, the sky a too-familiar red. After ruling out some other options, the team decides to stake out a fortress they see in the distance (despite Ash pulling a very foreboding tarot card while contemplating the subject). \n\nHannah and Em disguised as golden knights (with Rataoullie AB under Hannah’s helmet) approach the fortress directly while the rest of our heroes go around back to sneak in. However, things quickly devolve into chaos and danger when the golden robed Vatican-esque figure who emerges from the fort’s stronghold sees through their disguise (shocking, since these kids have tons of experience with magic compared to someone literally from this magical world).\n\nWhen disguises fail, Hannah, Em, and Ab resort to attacking by force and magic, and it’s not going well. The rest of the party hears the commotion and scrambles to help, but things have escalated quickly and they are not yet within aiding distance… And more real golden knights emerge from the shadows, one wielding an already bloodied cleaver. \n\nTwo brief magical training sessions with a talking chinchilla is enough to confidently enter a hostile supernatural world ready to save the day and end a decades-long battle, right? These teenagers sure think so. \n",
    "spotifyId": "3qE6p9fN4YeILT0cQcY1cD"
  },
  {
    "number": 13,
    "title": "Applebee the Myrehare",
    "author": "Tori Simpson",
    "synopsis": "When his new apprentices are faced with their probable demise, Applebee makes a challenging sacrifice.",
    "recap": "January 12, 1991:\n\nEven though snow falls gently from the red sky above, our heroes’ welcome into the magical world of the Myre is anything but gentle. Within the wooden walls of the fortress, three of our party are locked in mortal battle. \n\nThough Hannah expertly shot the priest in the neck with her hunting rifle, they are clearly hard to injure when they continue to attack AB and Em with great force at close quarters. The priest raises their hands to shoot red crackling energy at Em and AB, which covers the pair in the insidious red foam; however, we, too, are tough eggs to crack. Em continues her grapple with the Vatican-esque figure while AB runs deeper into the fortress (and towards a golden-clad knight with a very foreboding bloodied cleaver in their grip). AB and the knight engage in battle while Hannah shoots the priest in the back of the head to give Em a chance to make a run for it. Em dashes away to safety towards the rest of the party who heard the commotion and are currently running to the front of the fortress at a safe distance, knowing inherently that further fighting is not going to end well. KG, Michelle, Ash, and Nick meet Em among the trees outside the fortress, and Hannah, instead of closing the distance to safety, decides to make a last-ditch attempt to go after AB who is still in the throes of battle with the imposing knight. \n\nUnfortunately, though this was an understandable act of bravery, it was not a smart one. The priest immediately takes Hannah down as she approaches with more of their poisonous magic. First AB saved Em by putting himself in the line of fire, and he continues to do so for Hannah (and perhaps someone else deep inside the fortress) by moving ever inward despite being in very real danger. The priest turns their focus to AB and the knight, giving Michelle a window to heal Hannah and bring her back from the brink of death. Nick then hauls her over one shoulder and they book it away from what began as a side quest driven by curiosity, and will end on a much darker note. \n\nThe harsh sounds of battle and concerning cries of pain can be heard from within the fortress, and perhaps it is better that the teens don’t know exactly what passes within, save that AB died nobly and the the certainty that he will see his dear Sylvano very soon, and that he gave his life to save others who can continue the fight against this invasive evil. \n",
    "spotifyId": "7G7tgVYORlDuVprcYHuFJh"
  }
]